#######################################################
# String
#######################################################

"""
    1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому, наприклад:
     st = 'as 23 fdfdg544' введена строка
     2,3,5,4,4             #вивело в консолі.
"""

st1 = 'as 23 fdfdg544'
st_result = [i for i in st1 if i.isdigit()]
print('----------------------------------')
print("st = 'as 23 fdfdg544'")
print('task.1: ', ','.join(st_result))
print('----------------------------------')

"""
    2)написати прогу яка вибирає зі введеної строки числа і виводить їх так як вони написані
    наприклад:
    st = 'as 23 fdfdg544 34' #введена строка
    23, 544, 34              #вивело в консолі
"""

st2 = 'as 23 fdfdg544 34'
st_res2 = []
res2 = ''
for i in st2:
    if i.isdigit():
        res2 += i
    else:
        if res2 != '':
            st_res2.append(res2)
            res2 = ''
if res2 != '':
    st_res2.append(res2)
print('----------------------------------')
print("st = 'as 23 fdfdg544 34'")
print('Task-2: ', ','.join(st_res2))
print('----------------------------------')
