#######################################################
# list comprehension
#######################################################
"""
    3)есть строка:
    greeting = 'Hello, world'
    записать каждый символ в лист поменяв его на верхний регистр
    пример:
    ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
"""

greeting = 'Hello, world'
list_greeting = [i.upper() for i in greeting]
print("greeting = 'Hello, world'")
print('Task_3: ', list_greeting)
print('----------------------------------')


"""
4) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
пример:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
"""
list_odds = [i ** 2 for i in range(50) if i % 2 != 0]
print('Task_4:', list_odds)
print('----------------------------------')
